client/result/tomcat/result-tomcat-10000-1.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Apache-Coyote/1.1
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   9.062 seconds
Complete requests:      10000
Failed requests:        342
   (Connect: 0, Receive: 222, Length: 120, Exceptions: 0)
Write errors:           474
Total transferred:      3249824 bytes
HTML transferred:       842180 bytes
Requests per second:    1103.56 [#/sec] (mean)
Time per request:       115.988 [ms] (mean)
Time per request:       0.906 [ms] (mean, across all concurrent requests)
Transfer rate:          350.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3  114  50.2    138    1209
Processing:     0    1   1.1      1      22
Waiting:        0    0   0.7      0       9
Total:          6  115  50.1    139    1209

Percentage of the requests served within a certain time (ms)
  50%    139
  66%    141
  75%    141
  80%    142
  90%    144
  95%    149
  98%    155
  99%    163
 100%   1209 (longest request)