client/result/tomcat/result-tomcat-200-3.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Apache-Coyote/1.1
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        0 bytes

Concurrency Level:      128
Time taken for tests:   0.025 seconds
Complete requests:      200
Failed requests:        298
   (Connect: 0, Receive: 114, Length: 184, Exceptions: 0)
Write errors:           126
Total transferred:      57072 bytes
HTML transferred:       14790 bytes
Requests per second:    7979.57 [#/sec] (mean)
Time per request:       16.041 [ms] (mean)
Time per request:       0.125 [ms] (mean, across all concurrent requests)
Transfer rate:          2223.68 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4    8   2.6      7      12
Processing:     0    3   3.8      0      11
Waiting:        0    2   2.2      2       7
Total:          4   11   3.5     12      18

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     12
  75%     12
  80%     14
  90%     16
  95%     17
  98%     17
  99%     17
 100%     18 (longest request)